app/controllers/api/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 21]]
---
  def index
    @comments = Comment.where(post_id: params[:post_id])