app/controllers/api/friend_requests_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1048], ["LIMIT", 1]]
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."friend_id" = $1  [["friend_id", 1048]]
---
  def index
    @user = User.find_by(id: params[:user_id])
    @user_profile_photo = @user.profile_photo
    @user_background_photo = @user.background_photo
    @user_friends = @user.friends
    @user_friend_requests = @user.friend_requests
    @user_friend_requests_sent = @user.friend_requests_sent
    @friend_requests = FriendRequest.where(friend_id: params[:user_id])