app/controllers/api/friendships_controller.rb

  def index
    @friendships = Friendship.where(friend_id: params[:user_id])
    @recommended_friends = Friendship.recommended_friends(params[:user_id])
    @user = User.find_by(id: params[:user_id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 1049]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1049], ["id", 1050], ["id", 1051], ["id", 1052], ["id", 1053], ["id", 1054]]