app/controllers/api/posts_controller.rb

  def index
    main_posts_arr = Post.main_posts(params[:user_id])
    @main_posts = Posts.where(id: main_posts_arr.map(&:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1049]]

  def create
    @post = Post.new(post_params)
    if @post.save
      @posts = Post.where(user_id: params[:user_id])
---
INSERT INTO "posts" ("user_id", "poster_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 56], ["poster_id", 56], ["body", "my third post here we go!"], ["created_at", "2021-10-05 23:49:11.995908"], ["updated_at", "2021-10-05 23:49:11.995908"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 25], ["LIMIT", 1]]

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 25]]