app/controllers/api/users_controller.rb

  def index
    @posts = Post.where(user_id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 28]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]