app/views/api/friend_requests/index.json.jbuilder

SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 1048]]
---
@friend_requests.includes(:user).each do |friend_request|