app/views/api/posts/index.json.jbuilder

json.set! :profile_posts do
@posts.includes(:poster, :user, :comments, :likes).each do |post|
---
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 1048]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 658], ["post_id", 659]]

    json.set! :comments do
      json.array! post.comments.includes(:user).each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 660]]
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 1049]]