app/views/api/users/show.json.jbuilder

json.set! :notifications do
  @user_friend_requests.includes(:user).each do |friend_request|
---
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 1051]]