app/models/friendship.rb

INSERT INTO "friendships" ("created_at", "updated_at", "user_id", "friend_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-02-21 06:40:02.864940"], ["updated_at", "2022-02-21 06:40:02.864940"], ["user_id", 1049], ["friend_id", 1048]]
---
  def create_requited_friendship
    Friendship.create(user_id: self.friend_id, friend_id: self.user_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1049], ["LIMIT", 1]]
---
  def self.recommended_friends(user_id)
    recommended_friends = []
    user = User.find_by(id: user_id)