app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "OeLxdzaPO0awuQX0cj9zlA"], ["updated_at", "2022-02-21 06:56:11.184422"], ["id", 1048]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!

INSERT INTO "profile_photos" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-02-21 06:39:50.960583"], ["updated_at", "2022-02-21 06:39:50.960583"], ["user_id", 1048]]
INSERT INTO "background_photos" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-02-21 06:39:51.095354"], ["updated_at", "2022-02-21 06:39:51.095354"], ["user_id", 1048]]
---
  def add_default_photos
    self.profile_photo ||= ProfilePhoto.create(user_id: self.id)
    self.background_photo ||= BackgroundPhoto.create(user_id: self.id)