app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KE8DHwMcXpkqwFa5QlevCQ"], ["updated_at", "2021-09-30 16:27:01.749976"], ["id", 12]]