app/views/layouts/application.html.erb

SELECT  "profile_photos".* FROM "profile_photos" WHERE "profile_photos"."user_id" = $1 LIMIT $2  [["user_id", 1048], ["LIMIT", 1]]
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."friend_id" = $1  [["friend_id", 1048]]
---
        window.currentUser = {
          "id": "<%= current_user.id %>",
          "email": "<%= current_user.email %>",
          "firstName": "<%= current_user.first_name %>",
          "lastName": "<%= current_user.last_name %>",
          "profilePhoto": {
            "imageUrl": "<%= url_for(current_user.profile_photo.photo)%>"
          },
          "notifications": "<%= current_user.friend_requests.to_a %>".split('FriendRequest')