app/views/api/friendships/index.json.jbuilder

json.set! :friendships do
  @friendships.includes(:user).each do |friendship|
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1049], ["id", 1050], ["id", 1051], ["id", 1052], ["id", 1053], ["id", 1054]]